app/Controllers/BancoController.php

    public function delete($id)
    {
        if (isset($_SESSION['tipo_usuario']) && $_SESSION['tipo_usuario'] == 0) {
            $bancoModel = new bancoModel($db);
            $cuentaModel = new cuentaModel($db);
            $cuentas = $cuentaModel->where('id_banco', $id)->findAll();
---
SELECT *
FROM "banco"
WHERE "id_banco" = '4'

    public function mostrar()
    {
        if (isset($_SESSION['tipo_usuario'])) {
            $bancoModel = new bancoModel($db);
            $request = \Config\Services::request();
            if (strtolower($this->request->getMethod()) !== 'post') {
                return  view('bancoView\mostrarBancoView', [
                    'validation' => Services::validation(),
                    'bancos' => $bancoModel->findAll(),
                ]);
            }
            $data = $bancoModel->where($request->getPost('selectForma'), $request->getPost('inputValor'))->findAll();
            if ($request->getPost('inputValor') == "") {
                $data = $bancoModel->findAll();
---
SELECT *
FROM "banco"