app/Controllers/BancoController.php

SELECT *
FROM "banco"
---
    public function mostrar()
    {
        if (isset($_SESSION['tipo_usuario'])) {
            $bancoModel = new bancoModel($db);
            $request = \Config\Services::request();
            if (strtolower($this->request->getMethod()) !== 'post') {
                return  view('bancoView\mostrarBancoView', [
                    'validation' => Services::validation(),
                    'bancos' => $bancoModel->findAll(),
                ]);