app/Controllers/ClienteController.php

INSERT INTO "usuarios" ("usuario", "contrasena", "tipo_usuario") VALUES ('Mat', '121212', 1)
SELECT *
FROM "usuarios"
WHERE "usuario" = 'Mat'
INSERT INTO "cliente" ("nombre_apellido", "direccion", "telefono", "fecha_nacimiento", "dni", "cuit_cuil", "id_usuario") VALUES ('Mat', 'sadas', '121312', '1212-12-12', '121212', '12112', 16)
---
                'contrasena' => $request->getPost('inputDocumento'),
                'tipo_usuario' => 1,
            );
            if ($usuarioModel->insert($user)) {
                $u = $usuarioModel->where('usuario', $request->getPostGet('inputNomyApe'))->findAll();
                $data['id_usuario'] = (int)$u[0]["id_usuario"];
                if (!$clienteModel->insert($data)) {

SELECT *
FROM "cliente"
WHERE "dni" = '1212'
---
    public function update($dni)
    {
        if (isset($_SESSION['tipo_usuario'])) {
            $request = \Config\Services::request();
            $usuarioModel = new usuarioModel($db);
            $clienteModel = new clienteModel($db);
            $cliente = $clienteModel->where('dni', $dni)->findAll();

SELECT *
FROM "cliente"
---
    public function mostrar()
    {
        if (isset($_SESSION['tipo_usuario']) && $_SESSION['tipo_usuario'] == 0) {
            $request = \Config\Services::request();
            $clienteModel = new clienteModel($db);
            if (strtolower($this->request->getMethod()) !== 'post') {
                return view('components\header') . view('components\navbar') . view('clienteView\mostrarClienteView', [
                    'validation' => Services::validation(),
                    'clientes' => $clienteModel->findAll(),
                ]);

SELECT "id_titular"
FROM "cuenta"
WHERE "id_banco" = '5'
---
    public function mostrarClientesSegunBanco($id)
    {
        if (isset($_SESSION['tipo_usuario']) && $_SESSION['tipo_usuario'] == 0) {
            $clienteModel = new clienteModel($db);
            $cuentaModel = new cuentaModel($db);
            $cuentas = $cuentaModel->select('id_titular')->where('id_banco', $id)->findAll();