app/Controllers/ClienteController.php

    public function mostrar()
    {
        if (isset($_SESSION['tipo_usuario']) && $_SESSION['tipo_usuario'] == 0) {
            $request = \Config\Services::request();
            $clienteModel = new clienteModel($db);
            if (strtolower($this->request->getMethod()) !== 'post') {
                return  view('clienteView\mostrarClienteView', [
                    'validation' => Services::validation(),
                    'clientes' => $clienteModel->findAll(),
                ]);
---
SELECT *
FROM "cliente"