app/Controllers/ClienteController.php

SELECT *
FROM "cliente"
---
    public function mostrar()
    {
        $clienteModel = new clienteModel($db);
        if (strtolower($this->request->getMethod()) !== 'post') {
            return view('components\header') . view('components\navbar') . view('clienteView\mostrarClienteView', [
                'validation' => Services::validation(),
                'clientes' => $clienteModel->findAll(),
            ]);