app/Controllers/CuentaController.php

    public function create()
    {
        if (isset($_SESSION['tipo_usuario'])) {
            $request = \Config\Services::request();
            $cuentaModel = new cuentaModel($db);
            $clienteModel = new clienteModel($db);
            $bancoModel = new bancoModel($db);
            $bancos = $bancoModel->findAll();
---
SELECT *
FROM "banco"

                $data['cuentas'] = $valoresCuentas;
                return  view('cuentaView\mostrarCuentaView', $data);
            } else {
                $valoresUsuario = $usuarioModel->where('usuario', $_SESSION['usuario'])->findAll();
                if (strtolower($this->request->getMethod()) !== 'post') {
                    if (sizeof($valoresUsuario) > 0) {
                        $valoresClientes = $clienteModel->where('id_usuario', $valoresUsuario[0]['id_usuario'])->findAll();
                        if (sizeof($valoresClientes) > 0) {
                            $valoresCuentas = $cuentaModel->where('id_titular', $valoresClientes[0]['id_cliente'])->findAll();
                            for ($i = 0; sizeof($valoresCuentas) > $i; $i++) {
                                $valoresBanco = $bancoModel->where('id_banco', $valoresCuentas[$i]['id_banco'])->findAll();
---
SELECT *
FROM "usuarios"
WHERE "usuario" = 'Mathias Schuvab'
SELECT *
FROM "cliente"
WHERE "id_usuario" = '3'
SELECT *
FROM "cuenta"
WHERE "id_titular" = '1'
SELECT *
FROM "banco"
WHERE "id_banco" = '2'