app/Controllers/CuentaController.php

SELECT *
FROM "cuenta"
---
    public function mostrarCuentas()
    {
        if (isset($_SESSION['tipo_usuario'])) {
            if ($_SESSION['tipo_usuario'] == 0) {
                $cuentaModel = new cuentaModel($db);
                if (strtolower($this->request->getMethod()) !== 'post') {
                    $data['validation'] = $this->validator;
                    $data['cuentas'] = $cuentaModel->findAll();