app/Controllers/UsuarioController.php

    public function connect()
    {
        $userModel = new UsuarioModel($db);
        $request = Services::request();
        if (!isset($_SESSION['usuario'])) {
            if (($u = $userModel->where('usuario', $request->getPostGet('inputUser'))->findAll()) &&
                (password_verify($request->getPostGet('inputPassword'), $u[0]['contrasena']))
            ) {
---
SELECT *
FROM "usuarios"
WHERE "usuario" = 'admin'