app/Controllers/UsuarioController.php

SELECT *
FROM "usuarios"
WHERE "usuario" = 'admin'
INSERT INTO "usuarios" ("usuario", "contrasena", "tipo_usuario") VALUES ('admin', '$2y$10$TpNy8IWljnrt3MWKEyDdleyY1vACNveQjvh7ywgw80JbV8zVPGE1K', 0)
---
    public function __construct()
    {
        $usuarioModel = new UsuarioModel($db);
        $usuario = $usuarioModel->where('usuario', 'admin')->findAll();
        if (sizeof($usuario) == 0) {
            $user = array(
                'usuario' => 'admin',
                'contrasena' => password_hash('admin', PASSWORD_DEFAULT),
                'tipo_usuario' => 0,
            );
            $usuarioModel->insert($user);
            $user = array(
                'usuario' => 'Jefe',
                'contrasena' => password_hash('admin', PASSWORD_DEFAULT),
                'tipo_usuario' => 0,
            );
            $usuarioModel->insert($user);
        }
        helper('form');
        $session = Services::session();
        $usuarioModel = new UsuarioModel($db);
        $user = array(
            'usuario' => 'admin',
            'contrasena' => password_hash('admin', PASSWORD_DEFAULT),
            'tipo_usuario' => 0,
        );
        $usuarioModel->insert($user);